# GroundConductorSizeSet Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroundConductorSizeSet Constructor
GroundConductorSizeSet Class See Also
---
Initializes a new instance of the GroundConductorSizeSet class
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public GroundConductorSizeSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
GroundConductorSizeSet()
```

# See Also
GroundConductorSizeSet Class
Autodesk.Revit.DB.Electrical Namespace